zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA366VLQ-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA366VLQ/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA577VPN-pinctrl.h with this part's differences applied
 * below (438 removed, 1 changed,
 * 319 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 47bd448f730443d5
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA366VLQ_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA366VLQ_WRAPPER_

#include "MCXA577VPN-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_A10_P0_14
#undef ADC0_A11_P0_15
#undef ADC1_A20_P5_0
#undef ADC1_A21_P5_1
#undef ADC1_A22_P5_2
#undef CMP0_IN0_P1_0
#undef CMP0_IN3_P1_5
#undef CMP0_INN4_P2_2
#undef CMP0_INN5_P2_3
#undef CMP0_INP4_P2_15
#undef CMP0_INP5_P2_23
#undef CT0_MAT0_P0_10
#undef CT0_MAT1_P0_11
#undef CT3_MAT0_P4_10
#undef CT3_MAT1_P4_11
#undef CT3_MAT2_P4_12
#undef CT3_MAT3_P4_13
#undef CT_INP0_P0_8
#undef CT_INP10_P1_14
#undef CT_INP11_P1_15
#undef CT_INP1_P0_9
#undef CT_INP4_P4_0
#undef CT_INP5_P4_1
#undef CT_INP8_P4_8
#undef CT_INP9_P4_9
#undef DAC1_OUT_P2_3
#undef ENET0_COL_P1_18
#undef ENET0_CRS_P1_19
#undef ENET0_MDC_P1_2
#undef ENET0_MDIO_P1_3
#undef ENET0_RXD0_P1_11
#undef ENET0_RXD1_P1_12
#undef ENET0_RXD2_P1_16
#undef ENET0_RXD3_P1_17
#undef ENET0_RXDV_P1_13
#undef ENET0_RXER_P1_15
#undef ENET0_RX_CLK_P1_14
#undef ENET0_TXD0_P1_6
#undef ENET0_TXD1_P1_7
#undef ENET0_TXD2_P1_8
#undef ENET0_TXD3_P1_9
#undef ENET0_TXEN_P1_5
#undef ENET0_TX_CLK_P1_4
#undef ESPI0_CLK_P3_16
#undef ESPI0_CLK_P4_10
#undef ESPI0_CSN_P3_17
#undef ESPI0_CSN_P4_11
#undef ESPI0_DATA0_P3_15
#undef ESPI0_DATA0_P4_9
#undef ESPI0_DATA1_P3_14
#undef ESPI0_DATA1_P4_8
#undef ESPI0_DATA2_P3_13
#undef ESPI0_DATA2_P4_13
#undef ESPI0_DATA3_P3_12
#undef ESPI0_DATA3_P4_12
#undef ESPI0_NOTIFY_P3_20
#undef ESPI0_NOTIFY_P4_7
#undef ESPI0_RST_P3_21
#undef ESPI0_RST_P4_6
#undef EWM0_IN_P0_16
#undef EWM0_IN_P0_18
#undef EWM0_IN_P0_22
#undef EWM0_IN_P0_4
#undef EWM0_OUT_B_P0_17
#undef EWM0_OUT_B_P0_19
#undef EWM0_OUT_B_P0_23
#undef EWM0_OUT_B_P0_5
#undef EXTAL32K_P5_0
#undef FLEXIO0_D0_P0_8
#undef FLEXIO0_D16_P4_8
#undef FLEXIO0_D17_P4_9
#undef FLEXIO0_D18_P4_10
#undef FLEXIO0_D19_P4_11
#undef FLEXIO0_D1_P0_9
#undef FLEXIO0_D2_P0_10
#undef FLEXIO0_D3_P0_11
#undef FLEXSPI0_A_DATA0_P3_8
#undef FLEXSPI0_A_DATA1_P3_9
#undef FLEXSPI0_A_DATA2_P3_10
#undef FLEXSPI0_A_DATA3_P3_11
#undef FLEXSPI0_A_DQS_P3_6
#undef FLEXSPI0_A_SCLK_P3_7
#undef FLEXSPI0_A_SS0_B_P3_0
#undef FLEXSPI0_A_SS1_B_P3_1
#undef FLEXSPI0_B_DATA0_P3_15
#undef FLEXSPI0_B_DATA1_P3_14
#undef FLEXSPI0_B_DATA2_P3_13
#undef FLEXSPI0_B_DATA3_P3_12
#undef FLEXSPI0_B_DQS_P3_1
#undef FLEXSPI0_B_SCLK_P3_16
#undef FLEXSPI0_B_SS0_B_P3_17
#undef FLEXSPI0_B_SS1_B_P3_6
#undef I3C0_PUR_P0_22
#undef I3C0_SCL_P0_21
#undef I3C0_SDA_P0_20
#undef I3C1_PUR_P1_15
#undef I3C1_SCL_P1_17
#undef I3C1_SCL_P1_9
#undef I3C1_SDA1_P1_14
#undef I3C1_SDA1_P1_7
#undef I3C1_SDA2_P1_19
#undef I3C1_SDA2_P1_6
#undef I3C1_SDA3_P1_18
#undef I3C1_SDA3_P1_5
#undef I3C1_SDA_P1_16
#undef I3C1_SDA_P1_8
#undef I3C2_PUR_P4_0
#undef I3C2_PUR_P4_12
#undef I3C2_SCL_P1_31
#undef I3C2_SCL_P4_3
#undef I3C2_SDA_P1_30
#undef I3C2_SDA_P4_4
#undef I3C3_PUR_P4_1
#undef I3C3_PUR_P4_13
#undef I3C3_SCL_P4_5
#undef I3C3_SCL_P4_6
#undef I3C3_SDA_P4_2
#undef I3C3_SDA_P4_7
#undef LPI2C0_SCLS_P0_22
#undef LPI2C0_SCL_P0_21
#undef LPI2C0_SDAS_P0_23
#undef LPI2C0_SDA_P0_20
#undef LPI2C3_HREQ_P3_24
#undef LPI2C3_HREQ_P3_3
#undef LPI2C3_HREQ_P4_7
#undef LPI2C3_SCLS_P3_22
#undef LPI2C3_SCLS_P3_5
#undef LPI2C3_SCLS_P4_12
#undef LPI2C3_SCL_P3_1
#undef LPI2C3_SCL_P4_1
#undef LPI2C3_SDAS_P3_23
#undef LPI2C3_SDAS_P3_4
#undef LPI2C3_SDAS_P4_13
#undef LPI2C3_SDA_P3_0
#undef LPI2C3_SDA_P4_0
#undef LPI2C4_HREQ_P0_11
#undef LPI2C4_HREQ_P4_13
#undef LPI2C4_SCLS_P0_13
#undef LPI2C4_SCLS_P1_17
#undef LPI2C4_SCLS_P1_5
#undef LPI2C4_SCLS_P4_9
#undef LPI2C4_SCL_P0_14
#undef LPI2C4_SCL_P1_18
#undef LPI2C4_SCL_P1_6
#undef LPI2C4_SCL_P4_10
#undef LPI2C4_SDAS_P0_12
#undef LPI2C4_SDAS_P1_16
#undef LPI2C4_SDAS_P1_4
#undef LPI2C4_SDAS_P4_8
#undef LPI2C4_SDA_P0_15
#undef LPI2C4_SDA_P1_19
#undef LPI2C4_SDA_P1_7
#undef LPI2C4_SDA_P4_11
#undef LPSPI2_PCS0_P2_3
#undef LPSPI2_PCS0_P4_2
#undef LPSPI2_PCS1_P2_6
#undef LPSPI2_PCS1_P4_0
#undef LPSPI2_PCS2_P2_5
#undef LPSPI2_PCS2_P4_6
#undef LPSPI2_PCS3_P2_4
#undef LPSPI2_PCS3_P4_7
#undef LPSPI2_SCK_P2_1
#undef LPSPI2_SCK_P4_3
#undef LPSPI2_SDI_P2_2
#undef LPSPI2_SDI_P4_5
#undef LPSPI2_SDO_P2_0
#undef LPSPI2_SDO_P4_4
#undef LPSPI3_PCS0_P3_0
#undef LPSPI3_PCS0_P3_17
#undef LPSPI3_PCS0_P3_23
#undef LPSPI3_PCS1_P3_1
#undef LPSPI3_PCS1_P3_26
#undef LPSPI3_PCS1_P3_6
#undef LPSPI3_PCS2_P3_10
#undef LPSPI3_PCS2_P3_13
#undef LPSPI3_PCS2_P3_25
#undef LPSPI3_PCS3_P3_11
#undef LPSPI3_PCS3_P3_12
#undef LPSPI3_PCS3_P3_24
#undef LPSPI3_SCK_P3_16
#undef LPSPI3_SCK_P3_21
#undef LPSPI3_SCK_P3_7
#undef LPSPI3_SDI_P3_14
#undef LPSPI3_SDI_P3_22
#undef LPSPI3_SDI_P3_9
#undef LPSPI3_SDO_P3_15
#undef LPSPI3_SDO_P3_20
#undef LPSPI3_SDO_P3_8
#undef LPSPI4_PCS0_P0_23
#undef LPSPI4_PCS0_P3_5
#undef LPSPI4_PCS1_P0_14
#undef LPSPI4_PCS1_P3_26
#undef LPSPI4_PCS2_P0_13
#undef LPSPI4_PCS2_P3_25
#undef LPSPI4_PCS3_P0_12
#undef LPSPI4_PCS3_P3_24
#undef LPSPI4_SCK_P0_21
#undef LPSPI4_SCK_P3_3
#undef LPSPI4_SDI_P0_22
#undef LPSPI4_SDI_P3_4
#undef LPSPI4_SDO_P0_20
#undef LPSPI4_SDO_P3_2
#undef LPSPI5_PCS0_P1_15
#undef LPSPI5_PCS0_P4_11
#undef LPSPI5_PCS1_P1_18
#undef LPSPI5_PCS1_P4_1
#undef LPSPI5_PCS2_P1_17
#undef LPSPI5_PCS2_P4_13
#undef LPSPI5_PCS3_P1_16
#undef LPSPI5_PCS3_P4_12
#undef LPSPI5_SCK_P1_13
#undef LPSPI5_SCK_P4_10
#undef LPSPI5_SDI_P1_14
#undef LPSPI5_SDI_P4_8
#undef LPSPI5_SDO_P1_12
#undef LPSPI5_SDO_P4_9
#undef LPTMR0_ALT2_P5_0
#undef LPTMR0_ALT2_P5_5
#undef LPUART0_CTS_B_P4_11
#undef LPUART0_RTS_B_P4_10
#undef LPUART0_RXD_P4_8
#undef LPUART0_TXD_P4_9
#undef P0_10
#undef P0_11
#undef P0_8
#undef P0_9
#undef P2_28
#undef P2_29
#undef P2_30
#undef P2_31
#undef P4_10
#undef P4_11
#undef P4_12
#undef P4_13
#undef P4_8
#undef P4_9
#undef P5_0
#undef P5_1
#undef P5_2
#undef P5_3
#undef P5_4
#undef P5_5
#undef P5_6
#undef P5_7
#undef P5_8
#undef P5_9
#undef RTC_CLKOUT_P5_3
#undef SMARTDMA_PIO0_P0_4
#undef SMARTDMA_PIO0_P1_4
#undef SMARTDMA_PIO0_P3_0
#undef SMARTDMA_PIO10_P0_20
#undef SMARTDMA_PIO10_P1_14
#undef SMARTDMA_PIO10_P3_10
#undef SMARTDMA_PIO11_P0_21
#undef SMARTDMA_PIO11_P1_15
#undef SMARTDMA_PIO11_P3_11
#undef SMARTDMA_PIO12_P0_22
#undef SMARTDMA_PIO12_P1_16
#undef SMARTDMA_PIO12_P3_12
#undef SMARTDMA_PIO13_P0_23
#undef SMARTDMA_PIO13_P1_17
#undef SMARTDMA_PIO13_P3_13
#undef SMARTDMA_PIO14_P1_18
#undef SMARTDMA_PIO14_P2_10
#undef SMARTDMA_PIO14_P3_14
#undef SMARTDMA_PIO15_P1_19
#undef SMARTDMA_PIO15_P2_11
#undef SMARTDMA_PIO15_P3_15
#undef SMARTDMA_PIO16_P2_12
#undef SMARTDMA_PIO16_P3_16
#undef SMARTDMA_PIO17_P2_13
#undef SMARTDMA_PIO17_P3_17
#undef SMARTDMA_PIO18_P2_15
#undef SMARTDMA_PIO18_P3_18
#undef SMARTDMA_PIO19_P2_16
#undef SMARTDMA_PIO19_P3_19
#undef SMARTDMA_PIO1_P0_5
#undef SMARTDMA_PIO1_P1_5
#undef SMARTDMA_PIO1_P3_1
#undef SMARTDMA_PIO20_P2_17
#undef SMARTDMA_PIO20_P3_20
#undef SMARTDMA_PIO20_P4_0
#undef SMARTDMA_PIO21_P2_19
#undef SMARTDMA_PIO21_P3_21
#undef SMARTDMA_PIO21_P4_1
#undef SMARTDMA_PIO22_P2_20
#undef SMARTDMA_PIO22_P3_22
#undef SMARTDMA_PIO22_P4_2
#undef SMARTDMA_PIO23_P2_21
#undef SMARTDMA_PIO23_P3_23
#undef SMARTDMA_PIO23_P4_3
#undef SMARTDMA_PIO24_P2_0
#undef SMARTDMA_PIO24_P3_24
#undef SMARTDMA_PIO24_P4_4
#undef SMARTDMA_PIO25_P2_1
#undef SMARTDMA_PIO25_P3_25
#undef SMARTDMA_PIO25_P4_5
#undef SMARTDMA_PIO26_P2_2
#undef SMARTDMA_PIO26_P3_26
#undef SMARTDMA_PIO26_P4_6
#undef SMARTDMA_PIO27_P2_3
#undef SMARTDMA_PIO27_P3_27
#undef SMARTDMA_PIO27_P4_7
#undef SMARTDMA_PIO28_P2_4
#undef SMARTDMA_PIO28_P4_8
#undef SMARTDMA_PIO29_P2_5
#undef SMARTDMA_PIO29_P4_9
#undef SMARTDMA_PIO2_P0_6
#undef SMARTDMA_PIO2_P1_6
#undef SMARTDMA_PIO2_P3_2
#undef SMARTDMA_PIO30_P2_6
#undef SMARTDMA_PIO30_P4_10
#undef SMARTDMA_PIO31_P2_7
#undef SMARTDMA_PIO31_P4_11
#undef SMARTDMA_PIO3_P0_7
#undef SMARTDMA_PIO3_P1_7
#undef SMARTDMA_PIO3_P3_3
#undef SMARTDMA_PIO4_P0_14
#undef SMARTDMA_PIO4_P1_8
#undef SMARTDMA_PIO4_P3_4
#undef SMARTDMA_PIO5_P0_15
#undef SMARTDMA_PIO5_P1_9
#undef SMARTDMA_PIO5_P3_5
#undef SMARTDMA_PIO6_P0_16
#undef SMARTDMA_PIO6_P1_10
#undef SMARTDMA_PIO6_P3_6
#undef SMARTDMA_PIO7_P0_17
#undef SMARTDMA_PIO7_P1_11
#undef SMARTDMA_PIO7_P3_7
#undef SMARTDMA_PIO8_P0_18
#undef SMARTDMA_PIO8_P1_12
#undef SMARTDMA_PIO8_P3_8
#undef SMARTDMA_PIO9_P0_19
#undef SMARTDMA_PIO9_P1_13
#undef SMARTDMA_PIO9_P3_9
#undef SPC_LPREQ_P5_2
#undef SPC_LPREQ_P5_4
#undef TAMPER0_P5_2
#undef TAMPER1_P5_3
#undef TAMPER2_P5_4
#undef TAMPER3_P5_5
#undef TAMPER4_P5_6
#undef TAMPER5_P5_7
#undef TAMPER6_P5_8
#undef TAMPER7_P5_9
#undef TENBASET1S_ED_P1_1
#undef TENBASET1S_ED_P1_12
#undef TENBASET1S_RX_P1_0
#undef TENBASET1S_RX_P1_11
#undef TENBASET1S_TX_P1_13
#undef TENBASET1S_TX_P1_2
#undef TRIG_IN10_P5_0
#undef TRIG_IN10_P5_5
#undef TRIG_IN11_P5_3
#undef TRIG_IN11_P5_7
#undef TRIG_OUT6_P5_1
#undef TRIG_OUT6_P5_6
#undef TRIG_OUT7_P5_4
#undef TSI0_CH0_P5_3
#undef TSI0_CH10_P0_22
#undef TSI0_CH11_P0_23
#undef TSI0_CH12_P1_0
#undef TSI0_CH13_P1_1
#undef TSI0_CH14_P1_2
#undef TSI0_CH15_P1_3
#undef TSI0_CH16_P1_4
#undef TSI0_CH17_P1_5
#undef TSI0_CH18_P1_6
#undef TSI0_CH19_P1_7
#undef TSI0_CH1_P5_4
#undef TSI0_CH20_P1_10
#undef TSI0_CH21_P1_11
#undef TSI0_CH22_P1_12
#undef TSI0_CH23_P1_13
#undef TSI0_CH24_P1_14
#undef TSI0_CH25_P1_15
#undef TSI0_CH26_P1_16
#undef TSI0_CH27_P1_17
#undef TSI0_CH28_P1_18
#undef TSI0_CH29_P1_19
#undef TSI0_CH2_P5_5
#undef TSI0_CH30_P2_0
#undef TSI0_CH31_P2_1
#undef TSI0_CH32_P2_2
#undef TSI0_CH33_P2_3
#undef TSI0_CH34_P2_4
#undef TSI0_CH35_P2_5
#undef TSI0_CH36_P2_6
#undef TSI0_CH37_P2_7
#undef TSI0_CH38_P2_12
#undef TSI0_CH39_P2_13
#undef TSI0_CH3_P5_6
#undef TSI0_CH40_P2_15
#undef TSI0_CH41_P2_16
#undef TSI0_CH42_P2_17
#undef TSI0_CH43_P2_19
#undef TSI0_CH44_P2_20
#undef TSI0_CH45_P2_21
#undef TSI0_CH46_P3_2
#undef TSI0_CH47_P3_3
#undef TSI0_CH48_P3_4
#undef TSI0_CH49_P3_5
#undef TSI0_CH4_P0_16
#undef TSI0_CH50_P3_18
#undef TSI0_CH51_P3_19
#undef TSI0_CH52_P3_20
#undef TSI0_CH53_P3_21
#undef TSI0_CH54_P3_22
#undef TSI0_CH55_P3_23
#undef TSI0_CH56_P3_24
#undef TSI0_CH57_P3_25
#undef TSI0_CH58_P4_0
#undef TSI0_CH59_P4_1
#undef TSI0_CH5_P0_17
#undef TSI0_CH60_P4_2
#undef TSI0_CH61_P4_3
#undef TSI0_CH62_P4_4
#undef TSI0_CH63_P4_5
#undef TSI0_CH64_P4_6
#undef TSI0_CH65_P4_7
#undef TSI0_CH66_P4_8
#undef TSI0_CH67_P4_9
#undef TSI0_CH68_P4_10
#undef TSI0_CH69_P4_11
#undef TSI0_CH6_P0_18
#undef TSI0_CH7_P0_19
#undef TSI0_CH8_P0_20
#undef TSI0_CH9_P0_21
#undef USB1_OTGN_ID_P2_13
#undef USB1_OTGN_OC_P2_17
#undef USB1_OTGN_PWR_P2_16
#undef USB1_VBUSVALID_EXT_P2_12
#undef USB1_VBUSVALID_EXT_P2_15
#undef VBAT_WAKEUP_B_P5_2
#undef VREFO_P2_7
#undef WUU0_IN26_P3_17
#undef WUU0_IN27_P3_20
#undef XTAL32K_P5_1

/* Signals with different mux data on this part */
#undef TRIG_IN4
#define TRIG_IN4/CT_INP6_P4_6_P4_6 A15X_MUX('4',6,1)

