zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA366VLQ-pinctrl.h
/* Signals specific to this part */
#define ADC0_A10_P0_20 A15X_MUX('0',20,0)
#define ADC0_A11_P0_21 A15X_MUX('0',21,0)
#define ADC1_A20_P3_31 A15X_MUX('3',31,0)
#define ADC1_A21_P3_30 A15X_MUX('3',30,0)
#define ADC1_A22_P3_29 A15X_MUX('3',29,0)
#define ADC2_A0_P2_4 A15X_MUX('2',4,0)
#define ADC2_A10_P0_5 A15X_MUX('0',5,0)
#define ADC2_A11_P0_7 A15X_MUX('0',7,0)
#define ADC2_A12_P0_12 A15X_MUX('0',12,0)
#define ADC2_A13_P0_13 A15X_MUX('0',13,0)
#define ADC2_A14_P0_14 A15X_MUX('0',14,0)
#define ADC2_A15_P0_15 A15X_MUX('0',15,0)
#define ADC2_A16_P4_0 A15X_MUX('4',0,0)
#define ADC2_A17_P4_1 A15X_MUX('4',1,0)
#define ADC2_A18_P4_2 A15X_MUX('4',2,0)
#define ADC2_A19_P4_3 A15X_MUX('4',3,0)
#define ADC2_A1_P2_10 A15X_MUX('2',10,0)
#define ADC2_A20_P4_4 A15X_MUX('4',4,0)
#define ADC2_A21_P4_5 A15X_MUX('4',5,0)
#define ADC2_A22_P4_6 A15X_MUX('4',6,0)
#define ADC2_A23_P4_7 A15X_MUX('4',7,0)
#define ADC2_A2_P2_6 A15X_MUX('2',6,0)
#define ADC2_A3_P2_24 A15X_MUX('2',24,0)
#define ADC2_A4_P2_16 A15X_MUX('2',16,0)
#define ADC2_A5_P2_12 A15X_MUX('2',12,0)
#define ADC2_A6_P2_20 A15X_MUX('2',20,0)
#define ADC2_A7_P2_7 A15X_MUX('2',7,0)
#define ADC2_A8_P0_2 A15X_MUX('0',2,0)
#define ADC2_A9_P0_4 A15X_MUX('0',4,0)
#define ADC3_A0_P2_5 A15X_MUX('2',5,0)
#define ADC3_A10_P3_4 A15X_MUX('3',4,0)
#define ADC3_A11_P3_5 A15X_MUX('3',5,0)
#define ADC3_A12_P3_6 A15X_MUX('3',6,0)
#define ADC3_A13_P3_7 A15X_MUX('3',7,0)
#define ADC3_A14_P3_12 A15X_MUX('3',12,0)
#define ADC3_A15_P3_13 A15X_MUX('3',13,0)
#define ADC3_A16_P3_14 A15X_MUX('3',14,0)
#define ADC3_A17_P3_15 A15X_MUX('3',15,0)
#define ADC3_A18_P3_20 A15X_MUX('3',20,0)
#define ADC3_A19_P3_21 A15X_MUX('3',21,0)
#define ADC3_A1_P2_11 A15X_MUX('2',11,0)
#define ADC3_A20_P3_22 A15X_MUX('3',22,0)
#define ADC3_A21_P3_23 A15X_MUX('3',23,0)
#define ADC3_A22_P3_24 A15X_MUX('3',24,0)
#define ADC3_A23_P3_25 A15X_MUX('3',25,0)
#define ADC3_A2_P2_23 A15X_MUX('2',23,0)
#define ADC3_A3_P2_25 A15X_MUX('2',25,0)
#define ADC3_A4_P2_17 A15X_MUX('2',17,0)
#define ADC3_A5_P2_13 A15X_MUX('2',13,0)
#define ADC3_A6_P2_21 A15X_MUX('2',21,0)
#define ADC3_A7_P2_7 A15X_MUX('2',7,0)
#define ADC3_A8_P3_2 A15X_MUX('3',2,0)
#define ADC3_A9_P3_3 A15X_MUX('3',3,0)
#define CLKOUT_P0_6 A15X_MUX('0',6,12)
#define CLKOUT_P3_8 A15X_MUX('3',8,12)
#define CMP0_IN0_P2_2 A15X_MUX('2',2,0)
#define CMP0_IN3_P1_0 A15X_MUX('1',0,0)
#define CMP1_IN0_P2_3 A15X_MUX('2',3,0)
#define CMP1_IN1_P0_3 A15X_MUX('0',3,0)
#define CMP1_IN2_P1_5 A15X_MUX('1',5,0)
#define CMP1_IN3_P1_1 A15X_MUX('1',1,0)
#define CMP1_OUT_P0_19 A15X_MUX('0',19,8)
#define CMP1_OUT_P0_4 A15X_MUX('0',4,8)
#define CMP1_OUT_P0_6 A15X_MUX('0',6,8)
#define CMP2_IN0_P2_4 A15X_MUX('2',4,0)
#define CMP2_IN1_P0_7 A15X_MUX('0',7,0)
#define CMP2_IN2_P0_23 A15X_MUX('0',23,0)
#define CMP2_IN3_P1_2 A15X_MUX('1',2,0)
#define CMP2_OUT_P0_20 A15X_MUX('0',20,8)
#define CMP2_OUT_P0_5 A15X_MUX('0',5,8)
#define CT0_MAT2_P3_30 A15X_MUX('3',30,4)
#define CT0_MAT3_P3_31 A15X_MUX('3',31,4)
#define CT3_MAT2_P3_28 A15X_MUX('3',28,5)
#define CT3_MAT3_P3_29 A15X_MUX('3',29,5)
#define CT_INP12_P3_28 A15X_MUX('3',28,4)
#define CT_INP3_P3_29 A15X_MUX('3',29,4)
#define FLEXIO0_D28_P3_28 A15X_MUX('3',28,6)
#define FLEXIO0_D29_P3_29 A15X_MUX('3',29,6)
#define FLEXIO0_D30_P3_30 A15X_MUX('3',30,6)
#define FLEXIO0_D31_P3_31 A15X_MUX('3',31,6)
#define FREQME_CLK_OUT0_P3_1 A15X_MUX('3',1,12)
#define FREQME_CLK_OUT1_P3_6 A15X_MUX('3',6,12)
#define I3C0_PUR_P1_11 A15X_MUX('1',11,10)
#define I3C0_SCL_P1_31 A15X_MUX('1',31,10)
#define I3C0_SCL_P1_9 A15X_MUX('1',9,10)
#define I3C0_SDA_P1_30 A15X_MUX('1',30,10)
#define I3C0_SDA_P1_8 A15X_MUX('1',8,10)
#define LCD_P0_P1_0 A15X_MUX('1',0,9)
#define LCD_P10_P1_12 A15X_MUX('1',12,9)
#define LCD_P11_P1_13 A15X_MUX('1',13,9)
#define LCD_P12_P1_14 A15X_MUX('1',14,9)
#define LCD_P13_P1_15 A15X_MUX('1',15,9)
#define LCD_P14_P1_16 A15X_MUX('1',16,9)
#define LCD_P15_P1_17 A15X_MUX('1',17,9)
#define LCD_P16_P0_12 A15X_MUX('0',12,9)
#define LCD_P17_P0_13 A15X_MUX('0',13,9)
#define LCD_P18_P0_14 A15X_MUX('0',14,9)
#define LCD_P19_P0_15 A15X_MUX('0',15,9)
#define LCD_P1_P1_1 A15X_MUX('1',1,9)
#define LCD_P20_P0_16 A15X_MUX('0',16,9)
#define LCD_P21_P0_17 A15X_MUX('0',17,9)
#define LCD_P22_P0_18 A15X_MUX('0',18,9)
#define LCD_P23_P0_19 A15X_MUX('0',19,9)
#define LCD_P24_P0_20 A15X_MUX('0',20,9)
#define LCD_P25_P0_21 A15X_MUX('0',21,9)
#define LCD_P26_P0_22 A15X_MUX('0',22,9)
#define LCD_P27_P0_23 A15X_MUX('0',23,9)
#define LCD_P28_P0_24 A15X_MUX('0',24,9)
#define LCD_P29_P0_25 A15X_MUX('0',25,9)
#define LCD_P2_P1_2 A15X_MUX('1',2,9)
#define LCD_P30_P0_26 A15X_MUX('0',26,9)
#define LCD_P31_P0_27 A15X_MUX('0',27,9)
#define LCD_P32_P3_0 A15X_MUX('3',0,9)
#define LCD_P33_P3_1 A15X_MUX('3',1,9)
#define LCD_P34_P3_6 A15X_MUX('3',6,9)
#define LCD_P35_P3_7 A15X_MUX('3',7,9)
#define LCD_P36_P3_8 A15X_MUX('3',8,9)
#define LCD_P37_P3_9 A15X_MUX('3',9,9)
#define LCD_P38_P3_10 A15X_MUX('3',10,9)
#define LCD_P39_P3_11 A15X_MUX('3',11,9)
#define LCD_P3_P1_3 A15X_MUX('1',3,9)
#define LCD_P40_P3_12 A15X_MUX('3',12,9)
#define LCD_P41_P3_13 A15X_MUX('3',13,9)
#define LCD_P42_P3_14 A15X_MUX('3',14,9)
#define LCD_P43_P3_15 A15X_MUX('3',15,9)
#define LCD_P44_P3_16 A15X_MUX('3',16,9)
#define LCD_P45_P3_17 A15X_MUX('3',17,9)
#define LCD_P46_P3_18 A15X_MUX('3',18,9)
#define LCD_P47_P3_19 A15X_MUX('3',19,9)
#define LCD_P4_P1_6 A15X_MUX('1',6,9)
#define LCD_P5_P1_7 A15X_MUX('1',7,9)
#define LCD_P6_P1_8 A15X_MUX('1',8,9)
#define LCD_P7_P1_9 A15X_MUX('1',9,9)
#define LCD_P8_P1_10 A15X_MUX('1',10,9)
#define LCD_P9_P1_11 A15X_MUX('1',11,9)
#define LCD_VLL1_P1_5 A15X_MUX('1',5,0)
#define LCD_VLL2_P1_4 A15X_MUX('1',4,0)
#define LPI2C3_HREQ_P3_29 A15X_MUX('3',29,2)
#define LPI2C3_SCLS_P3_30 A15X_MUX('3',30,2)
#define LPI2C3_SDAS_P3_31 A15X_MUX('3',31,2)
#define LPI2C3_SDA_P3_28 A15X_MUX('3',28,2)
#define LPTMR0_ALT2_P3_31 A15X_MUX('3',31,0)
#define LPUART4_CTS_B_P3_31 A15X_MUX('3',31,3)
#define LPUART4_RTS_B_P3_30 A15X_MUX('3',30,3)
#define LPUART4_RXD_P3_28 A15X_MUX('3',28,3)
#define OPAMP0_INN_P2_13 A15X_MUX('2',13,0)
#define OPAMP0_INP_P2_12 A15X_MUX('2',12,0)
#define OPAMP0_OUT_P2_15 A15X_MUX('2',15,0)
#define OPAMP1_INN_P2_17 A15X_MUX('2',17,0)
#define OPAMP1_INP_P2_16 A15X_MUX('2',16,0)
#define OPAMP1_OUT_P2_19 A15X_MUX('2',19,0)
#define OPAMP2_INN_P2_1 A15X_MUX('2',1,0)
#define OPAMP2_INP_P2_0 A15X_MUX('2',0,0)
#define OPAMP2_OUT_P2_6 A15X_MUX('2',6,0)
#define OPAMP3_INN_P2_21 A15X_MUX('2',21,0)
#define OPAMP3_INP_P2_20 A15X_MUX('2',20,0)
#define OPAMP3_OUT_P2_23 A15X_MUX('2',23,0)
#define P3_28 A15X_MUX('3',28,0)
#define P3_29 A15X_MUX('3',29,0)
#define P3_30 A15X_MUX('3',30,0)
#define P3_31 A15X_MUX('3',31,0)
#define PWM0_A0_P3_0 A15X_MUX('3',0,5)
#define PWM0_A0_P4_6 A15X_MUX('4',6,5)
#define PWM0_A1_P3_8 A15X_MUX('3',8,5)
#define PWM0_A1_P4_4 A15X_MUX('4',4,5)
#define PWM0_A2_P3_10 A15X_MUX('3',10,5)
#define PWM0_A2_P4_2 A15X_MUX('4',2,5)
#define PWM0_A3_P3_6 A15X_MUX('3',6,5)
#define PWM0_A3_P4_0 A15X_MUX('4',0,5)
#define PWM0_B0_P3_1 A15X_MUX('3',1,5)
#define PWM0_B0_P4_7 A15X_MUX('4',7,5)
#define PWM0_B1_P3_9 A15X_MUX('3',9,5)
#define PWM0_B1_P4_5 A15X_MUX('4',5,5)
#define PWM0_B2_P3_11 A15X_MUX('3',11,5)
#define PWM0_B2_P4_3 A15X_MUX('4',3,5)
#define PWM0_B3_P3_7 A15X_MUX('3',7,5)
#define PWM0_B3_P4_1 A15X_MUX('4',1,5)
#define PWM0_X0_P3_12 A15X_MUX('3',12,5)
#define PWM0_X0_P3_18 A15X_MUX('3',18,5)
#define PWM0_X0_P3_2 A15X_MUX('3',2,5)
#define PWM0_X1_P3_13 A15X_MUX('3',13,5)
#define PWM0_X1_P3_19 A15X_MUX('3',19,5)
#define PWM0_X1_P3_3 A15X_MUX('3',3,5)
#define PWM0_X2_P3_14 A15X_MUX('3',14,5)
#define PWM0_X2_P3_20 A15X_MUX('3',20,5)
#define PWM0_X2_P3_4 A15X_MUX('3',4,5)
#define PWM0_X3_P3_15 A15X_MUX('3',15,5)
#define PWM0_X3_P3_21 A15X_MUX('3',21,5)
#define PWM0_X3_P3_5 A15X_MUX('3',5,5)
#define PWM1_A0_P3_16 A15X_MUX('3',16,7)
#define PWM1_A0_P3_30 A15X_MUX('3',30,7)
#define PWM1_A0_P3_6 A15X_MUX('3',6,7)
#define PWM1_A1_P3_14 A15X_MUX('3',14,7)
#define PWM1_A2_P3_12 A15X_MUX('3',12,7)
#define PWM1_A3_P3_20 A15X_MUX('3',20,7)
#define PWM1_A3_P3_27 A15X_MUX('3',27,7)
#define PWM1_B0_P3_17 A15X_MUX('3',17,7)
#define PWM1_B0_P3_31 A15X_MUX('3',31,7)
#define PWM1_B0_P3_7 A15X_MUX('3',7,7)
#define PWM1_B1_P3_15 A15X_MUX('3',15,7)
#define PWM1_B2_P3_13 A15X_MUX('3',13,7)
#define PWM1_B3_P3_21 A15X_MUX('3',21,7)
#define PWM1_B3_P3_28 A15X_MUX('3',28,7)
#define PWM1_X0_P3_0 A15X_MUX('3',0,7)
#define PWM1_X0_P3_18 A15X_MUX('3',18,7)
#define PWM1_X1_P3_1 A15X_MUX('3',1,7)
#define PWM1_X1_P3_19 A15X_MUX('3',19,7)
#define PWM1_X2_P3_2 A15X_MUX('3',2,7)
#define PWM1_X2_P3_22 A15X_MUX('3',22,7)
#define PWM1_X3_P3_23 A15X_MUX('3',23,7)
#define PWM1_X3_P3_3 A15X_MUX('3',3,7)
#define SmartDMA_PIO0_P0_4 A15X_MUX('0',4,7)
#define SmartDMA_PIO0_P1_4 A15X_MUX('1',4,7)
#define SmartDMA_PIO0_P3_0 A15X_MUX('3',0,10)
#define SmartDMA_PIO10_P0_20 A15X_MUX('0',20,7)
#define SmartDMA_PIO10_P1_14 A15X_MUX('1',14,7)
#define SmartDMA_PIO10_P3_10 A15X_MUX('3',10,10)
#define SmartDMA_PIO11_P0_21 A15X_MUX('0',21,7)
#define SmartDMA_PIO11_P1_15 A15X_MUX('1',15,7)
#define SmartDMA_PIO11_P3_11 A15X_MUX('3',11,10)
#define SmartDMA_PIO12_P0_22 A15X_MUX('0',22,7)
#define SmartDMA_PIO12_P1_16 A15X_MUX('1',16,7)
#define SmartDMA_PIO12_P3_12 A15X_MUX('3',12,10)
#define SmartDMA_PIO13_P0_23 A15X_MUX('0',23,7)
#define SmartDMA_PIO13_P1_17 A15X_MUX('1',17,7)
#define SmartDMA_PIO13_P3_13 A15X_MUX('3',13,10)
#define SmartDMA_PIO14_P1_18 A15X_MUX('1',18,7)
#define SmartDMA_PIO14_P2_10 A15X_MUX('2',10,7)
#define SmartDMA_PIO14_P3_14 A15X_MUX('3',14,10)
#define SmartDMA_PIO15_P1_19 A15X_MUX('1',19,7)
#define SmartDMA_PIO15_P2_11 A15X_MUX('2',11,7)
#define SmartDMA_PIO15_P3_15 A15X_MUX('3',15,10)
#define SmartDMA_PIO16_P2_12 A15X_MUX('2',12,7)
#define SmartDMA_PIO16_P3_16 A15X_MUX('3',16,10)
#define SmartDMA_PIO17_P2_13 A15X_MUX('2',13,7)
#define SmartDMA_PIO17_P3_17 A15X_MUX('3',17,10)
#define SmartDMA_PIO18_P2_15 A15X_MUX('2',15,7)
#define SmartDMA_PIO18_P3_18 A15X_MUX('3',18,10)
#define SmartDMA_PIO19_P2_16 A15X_MUX('2',16,7)
#define SmartDMA_PIO19_P3_19 A15X_MUX('3',19,10)
#define SmartDMA_PIO1_P0_5 A15X_MUX('0',5,7)
#define SmartDMA_PIO1_P1_5 A15X_MUX('1',5,7)
#define SmartDMA_PIO1_P3_1 A15X_MUX('3',1,10)
#define SmartDMA_PIO20_P2_17 A15X_MUX('2',17,7)
#define SmartDMA_PIO20_P3_20 A15X_MUX('3',20,10)
#define SmartDMA_PIO20_P4_0 A15X_MUX('4',0,7)
#define SmartDMA_PIO21_P2_19 A15X_MUX('2',19,7)
#define SmartDMA_PIO21_P3_21 A15X_MUX('3',21,10)
#define SmartDMA_PIO21_P4_1 A15X_MUX('4',1,7)
#define SmartDMA_PIO22_P2_20 A15X_MUX('2',20,7)
#define SmartDMA_PIO22_P3_22 A15X_MUX('3',22,10)
#define SmartDMA_PIO22_P4_2 A15X_MUX('4',2,7)
#define SmartDMA_PIO23_P2_21 A15X_MUX('2',21,7)
#define SmartDMA_PIO23_P3_23 A15X_MUX('3',23,10)
#define SmartDMA_PIO23_P4_3 A15X_MUX('4',3,7)
#define SmartDMA_PIO24_P2_0 A15X_MUX('2',0,7)
#define SmartDMA_PIO24_P3_24 A15X_MUX('3',24,10)
#define SmartDMA_PIO24_P4_4 A15X_MUX('4',4,7)
#define SmartDMA_PIO25_P2_1 A15X_MUX('2',1,7)
#define SmartDMA_PIO25_P3_25 A15X_MUX('3',25,10)
#define SmartDMA_PIO25_P4_5 A15X_MUX('4',5,7)
#define SmartDMA_PIO26_P2_2 A15X_MUX('2',2,7)
#define SmartDMA_PIO26_P3_26 A15X_MUX('3',26,10)
#define SmartDMA_PIO26_P4_6 A15X_MUX('4',6,7)
#define SmartDMA_PIO27_P2_3 A15X_MUX('2',3,7)
#define SmartDMA_PIO27_P3_27 A15X_MUX('3',27,10)
#define SmartDMA_PIO27_P4_7 A15X_MUX('4',7,7)
#define SmartDMA_PIO28_P2_4 A15X_MUX('2',4,7)
#define SmartDMA_PIO28_P3_28 A15X_MUX('3',28,10)
#define SmartDMA_PIO29_P2_5 A15X_MUX('2',5,7)
#define SmartDMA_PIO29_P3_29 A15X_MUX('3',29,10)
#define SmartDMA_PIO2_P0_6 A15X_MUX('0',6,7)
#define SmartDMA_PIO2_P1_6 A15X_MUX('1',6,7)
#define SmartDMA_PIO2_P3_2 A15X_MUX('3',2,10)
#define SmartDMA_PIO30_P2_6 A15X_MUX('2',6,7)
#define SmartDMA_PIO30_P3_30 A15X_MUX('3',30,10)
#define SmartDMA_PIO31_P2_7 A15X_MUX('2',7,7)
#define SmartDMA_PIO31_P3_31 A15X_MUX('3',31,10)
#define SmartDMA_PIO3_P0_7 A15X_MUX('0',7,7)
#define SmartDMA_PIO3_P1_7 A15X_MUX('1',7,7)
#define SmartDMA_PIO3_P3_3 A15X_MUX('3',3,10)
#define SmartDMA_PIO4_P0_14 A15X_MUX('0',14,7)
#define SmartDMA_PIO4_P1_8 A15X_MUX('1',8,7)
#define SmartDMA_PIO4_P3_4 A15X_MUX('3',4,10)
#define SmartDMA_PIO5_P0_15 A15X_MUX('0',15,7)
#define SmartDMA_PIO5_P1_9 A15X_MUX('1',9,7)
#define SmartDMA_PIO5_P3_5 A15X_MUX('3',5,10)
#define SmartDMA_PIO6_P0_16 A15X_MUX('0',16,7)
#define SmartDMA_PIO6_P1_10 A15X_MUX('1',10,7)
#define SmartDMA_PIO6_P3_6 A15X_MUX('3',6,10)
#define SmartDMA_PIO7_P0_17 A15X_MUX('0',17,7)
#define SmartDMA_PIO7_P1_11 A15X_MUX('1',11,7)
#define SmartDMA_PIO7_P3_7 A15X_MUX('3',7,10)
#define SmartDMA_PIO8_P0_18 A15X_MUX('0',18,7)
#define SmartDMA_PIO8_P1_12 A15X_MUX('1',12,7)
#define SmartDMA_PIO8_P3_8 A15X_MUX('3',8,10)
#define SmartDMA_PIO9_P0_19 A15X_MUX('0',19,7)
#define SmartDMA_PIO9_P1_13 A15X_MUX('1',13,7)
#define SmartDMA_PIO9_P3_9 A15X_MUX('3',9,10)
#define TAMPER0_P3_31 A15X_MUX('3',31,0)
#define TAMPER1_P3_29 A15X_MUX('3',29,0)
#define TAMPER2_P3_26 A15X_MUX('3',26,0)
#define TAMPER3_P3_25 A15X_MUX('3',25,0)
#define TAMPER4_P3_19 A15X_MUX('3',19,0)
#define TAMPER5_P3_18 A15X_MUX('3',18,0)
#define TRIG_IN10/CT_INP14_P3_26_P3_26 A15X_MUX('3',26,4)
#define TRIG_IN10_P3_26 A15X_MUX('3',26,1)
#define TRIG_IN10_P3_31 A15X_MUX('3',31,1)
#define TRIG_IN11/CT_INP12_P3_28_P3_28 A15X_MUX('3',28,4)
#define TRIG_IN11_P3_24 A15X_MUX('3',24,1)
#define TRIG_IN11_P3_28 A15X_MUX('3',28,1)
#define TRIG_OUT6_P3_25 A15X_MUX('3',25,1)
#define TRIG_OUT6_P3_30 A15X_MUX('3',30,1)
#define TRIG_OUT7_P3_27 A15X_MUX('3',27,1)
#define USB0_VBUS_DET_P2_12 A15X_MUX('2',12,1)
#define WUU0_IN1_P0_7 A15X_MUX('0',7,0)
#define WUU0_IN26_P3_28 A15X_MUX('3',28,0)
#define WUU0_IN27_P3_29 A15X_MUX('3',29,0)
#define WUU0_IN30_P3_27 A15X_MUX('3',27,0)

#endif /* _ZEPHYR_DTS_BINDING_MCXA366VLQ_WRAPPER_ */
